[
    {
        "title": "Here is why Bitcoin price is stuck below $105K",
        "content": "Bitcoin price remains stuck below $105,000 over the last week, and data suggest the pattern could continue for a few more days, subject to the emergence of fresh catalysts. Key takeaways: Bitcoin price consolidates as resistance at $105,000 prevents rally to new all-time highs. Traders are slightly bearish, but historical data suggests that a sudden bullish move should not be ruled out. Bitcoin\nBTC\n$103,631\nprice has been consolidating within a roughly $3,500 range over the past seven days as the $105,000 level remains the overhead resistance to break. Data from Cointelegraph Markets Pro and Bitstamp shows that BTC's price has been oscillating between its resistance level at $105,000 and $101,500, where it has found support. “$BTC is stuck in a narrowing $101.5K–$104K range,” said Swissblock in a May 16 post on X.  The onchain data provider said that Bitcoin began consolidating after two failed attempts to break above the resistance at $105,000.  For market intelligence firm Santiment, failure to grow past the $105,00 level has seen traders flip slightly bearish again.  “Markets generally tend to move opposite to the crowd's expectations, suggesting there is a heightened probability of crypto markets rising due to this increased fear,” the firm explained in an X post, adding: Bitcoin has managed to sustain $100,000 as support for over a week while hitting 14-week highs of $105,700 on May 12.  Despite following broad volatility across risk assets, BTC/USD may have gone even higher were it not for maneuvers of large-volume trading entities on exchange order books, according to trading resource Material Indicators. Related: Bitcoin hitting $220K 'reasonable' in 2025, says gold-based forecast Looking at the Binance exchange, Material Indicators argued that large blocks of ask liquidity were stacked above the spot price, pinning the BTC price in range. An accompanying chart shows that these liquidity clusters currently sit between $105,000 and $110,000. “Unless we have a serious catalyst, I’m not expecting to see a sustainable breakout to the all-time high territory until BTC has a legit support test at $100,000,” it summarized in a May 16 post on X.   Material Indicators added that a key level to watch on the downside was the $98,000-$100,000 range. Meanwhile, popular trader Daan Crypto Trades said that the “start of the recent move” at $93,000 was essential for Bitcoin traders going forward. Bitcoin is trading “far away from any large liquidity clusters. The price didn't trade for a long time up here just yet. So, after the initial squeeze of shorts, there are not that many new positions built up around this area,” part of his own X post explained, adding: Material Indicators meanwhile paid additional attention to the 50-day and 100-day simple moving averages (SMAs), key longer-term trendlines that formed a bullish cross, indicating a “strong upward momentum for the macro trend.” For MN Capital founder Michael van de Poppe, $98,000 is a “crucial area to hold on to” in order to ensure continuation upward. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Animoca’s Yat Siu says student loans can supercharge DeFi growth",
        "content": "“The next big wave in Web3 is education,” said Yat Siu, chairman of Animoca Brands, on stage at Consensus Toronto. Bringing student loans onchain would increase the total value locked (TVL) in decentralized finance (DeFi) by more than four times, supercharging the industry, according to Yat Siu, chairman of Animoca Brands. Speaking at Consensus 2025 in Toronto, Siu pointed to the $3 trillion global student loan market as an untapped opportunity for the crypto industry. He said moving even 10% of that market onchain could significantly boost DeFi’s growth. “You basically more than quadruple TVL in all of DeFi,” he said, underscoring how the industry is still in its early stages.  Siu said that Web3-based financial tools for the education sector could drive mass crypto adoption, especially among the young and unbanked. “The first unbanked are the kids,” he said. “If a student receives a loan onchain and pays it back onchain — which is regulated, better, faster, cheaper — they become onboarded for crypto for life.”  Siu compared the situation to how PayPal and Venmo scaled by offering essential services to underserved users. He suggested that student loans could serve as crypto’s entry into the mainstream. The executive also highlighted Animoca Brands’ recent investment in Pencil Finance, a startup providing crypto-native student loans. Siu said the project operates in the Philippines and Indonesia, and plans to expand to the US.  On April 30, Pencil Finance announced a $10 million student loan financing initiative to provide cheaper, blockchain-backed loans.  Siu previously said in an interview that the industry needs these “positive-sum use cases” that everyone understands. He said students would be more pro-crypto if they had more opportunities through crypto loans.  Related: NFT founder stole millions from Bitcoin project, investors allege Siu also told the Consensus audience that education is a natural use case for Web3. He highlighted YouTube and TikTok, platforms that are often dismissed as entertainment applications. Siu said these social media apps are now the largest informal learning platforms in the world.  He said everything is tied to education and that Web3 could do something similar. “Education is actually fundamental, something we do all the time,” Siu said.  He suggested that by integrating financial infrastructure into educational experiences, Web3 could turn learning communities and reputational networks into capital assets, forming the basis of a new, decentralized financial ecosystem. Magazine: Binance Wallet ‘killing’ MetaMask and airdrops, Chinese RWA tokens: Asia Express Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Is XRP price going to crash again?",
        "content": "XRP trades below whale cost basis of $2.58, signaling risk of a broader pullback to $1.04 or $0.67 unless bulls reclaim key levels soon. Key takeaways: XRP is retesting a falling wedge breakout, which could lead to a rally toward $3.60. Whale wallets are in the red, and history shows this isn’t bullish for XRP price. A breakdown below $1.11 could trigger an inverse cup-and-handle pattern, targeting a sharp drop to $0.50. XRP\nXRP\n$2.40\nhas rebounded by more than 50% in the last five weeks to reach $2.42 on May 16. But the price remains 30% below its January 2025 peak of $3.40, raising concerns of a bull trap. Will XRP’s price sustain the recovery or drop further in the coming days? Let’s examine. XRP is completing a textbook retest of its falling wedge breakout, according to chartist CW. Often, after the breakout, the price comes back down to “retest” the wedge’s upper trendline. If it holds as support, meaning buyers step in and prevent the price from falling back into the wedge, it signals strong demand and renewed confidence in the uptrend. CW predicts XRP will hold above its falling wedge’s upper trendline, which could help its prices climb higher toward the technical upside target of $3.60. Related: History rhymes? XRP price gained 400% the last time whale flows flipped This target is obtained by adding the wedge’s maximum height to the breakout point, as shown below. The wedge setup suggests that XRP will likely not crash in the coming days. But if the price drops below the wedge’s upper trendline, the bullish setup risks invalidation, exposing XRP to declines toward the lower trendline at around $1.75. Simultaneously, XRP is possibly signi a bearish reversal signal as it forms an inverse cup-and-handle pattern. The pattern has developed over the past five months, with the rounded \"cup\" forming between December 2024 and March 2025, followed by the \"handle\" consolidation into May. The neckline support sits near $1.11. A confirmed breakdown below this level could validate the pattern and trigger a deeper correction. Based on the pattern’s height, the projected downside target is around $0.50, a nearly 80% drop from current levels. The declining volume during the handle phase and the neutral RSI reading near 50 further support the risk of bearish continuation. As of May 15, the XRP price is below the $2.58 average paid by its biggest holders—those holding over 10,000 XRP in their wallets. When XRP whales are in the red, the price often rebounds toward their average buy level, but this bounce can be short-lived. Historically, it’s followed by a broader pullback that tests the average entry prices of smaller holders. For example, in September 2021, XRP briefly rose to $1.19, just above the whale realized price of $1.01. But soon after, it dropped below $1.10, retesting the entry levels of other wallet groups as support. It shows that realized prices act as magnets for price action, indicating XRP could rise toward the whale realized prices of $2.58 in the short term. In the worst-case scenario, XRP’s price can drop to $0.67, the realized price of the 1,000-10,000 XRP balance cohort. Taking the aggregated realized price, XRP’s target appears to be around $1.04. On the other hand, a continued rally above $2.58 will suggest bullish conviction among whales, which could be boosted by the launch of spot XRP ETFs in the US. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Bitcoin hitting $220K ‘reasonable’ in 2025, says gold-based forecast",
        "content": "Bitcoin's \"power curve\" is churning out giant six-figure BTC price targets this year — can BTC/USD really reach $220,000 or more? Key points: New Bitcoin price targets leverage interplay with gold to deliver $200,000 and higher this year. Bitcoin price cycles remain in focus as part of the BTC price “power curve” model. Eating gold’s market cap could propel BTC/USD to nearly $1 million by the decade’s end. Bitcoin\nBTC\n$103,666\nhas a “decent chance” of hitting $250,000 or more in 2025 as attention turns to gold copycat moves. In his latest analysis, X analytics account Apsk32 argued that the four-year BTC price cycle should provide unprecedented highs this year. Bitcoin following gold to new all-time highs is a popular theory among bulls. Historically, BTC/USD follows XAU/USD higher with a delay of several months. For Apsk32, the implications are considerable this time around; with gold hitting a record $3,500 per ounce, the future for BTC price action is bright. “Bitcoin’s position relative to gold has improved considerably since April,” he told X followers alongside his dedicated “power curve” tool.  The power curve concept involves measuring Bitcoin price in gold ounces to avoid the inflationary nature of the US dollar. “Here, I’m measuring the value of the Bitcoin network (market cap) in gold ounces and fitting that value to a power curve,” Apsk32 explained in a dedicated X post in March. Among the results is a potential bull market top target that contextualizes the old 2017 top of $20,000. “If Bitcoin’s network value measured in gold continues to follow a power curve, and gold holds its current value, and Bitcoin’s price returns to ‘five years ahead of support,’ we could hit Josh’s $444K this year,” it added. This week, Apsk32 suggested that a more “reasonable” target for 2025 would be up to $220,000. “If we start getting above $250k, that’s what I would consider ‘higher than expected,’” he responded when asked about the outlook. Continuing the gold theme, Bitcoin analyst Sam Callahan considered data showing how high BTC/USD could go if it were to capture varying portions of gold’s market cap. Related: Bitcoin to $1M by 2028 as Hayes tells Europe to’ get your money out’ This could come about thanks to a shift toward “digital gold,” something widely anticipated to gain momentum in the coming years. “If gold hits $5,000/oz by 2030 and Bitcoin captures 50% of its market cap, that puts BTC at $924K,” Callahan noted, alongside the data from the latest report by In Gold We Trust, released this week.  The report said the data “does not represent a price prediction per se, but rather a scenario-based framework — rooted in our established gold model — that offers a clearer sense of what relative revaluations of non-sovereign hard assets might look like by decade’s end.” This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Crypto gaming interest drops in April, overall ecosystem healthier: DappRadar",
        "content": "“The blockchain gaming industry isn’t dead — it’s evolving. It’s moving from noise to signal,” says DappRadar analyst Sara Gherghelas. Blockchain gaming user activity dipped and funding slowed in April, but the overall ecosystem is healthier and maturing, according to blockchain analytics platform DappRadar. User activity dropped 10% over April, with blockchain gaming reaching a 2025 low of 4.8 million daily Unique Active Wallets, DappRadar analyst Sara Gherghelas said in the platform’s April Games Report. Gaming dominance over the decentralized app industry also fell and is now tied with decentralized finance at 21%.  Gherghelas said it’s clear user attention is shifting away from gaming, but under the surface, new infrastructure went live, major publishers doubled down, and high-quality games edged closer to launch. “The blockchain gaming industry isn’t dead — it’s evolving. It’s moving from noise to signal,” she said. “Teams are building, and capital continues to flow into the space. What we might be seeing is a healthier ecosystem — one driven less by speculative play-to-earn mechanics and more by users who have a genuine interest in gameplay, asset ownership and community.” April’s blockchain gaming investment activity also dropped 69% from March, reaching $21 million. Gherghelas said part of the drop is because investor and user interest is increasingly shifting toward real-world assets and artificial intelligence. Another factor is the macroeconomic landscape, with ongoing market uncertainty weighing on investor sentiment, making capital harder to secure for startups. Gherghelas said weaker projects “are falling away,” and funds are flowing into other projects that “are quietly laying the groundwork for the next generation of blockchain games.” “Investors are now optimizing for sustainable models, player engagement, and actual retention, not just token hype,” she added. “This shows that the market’s clearly in reset mode.” Gherghelas noted that “66% of all blockchain game funding in 2025 so far has gone to infrastructure,” signaling a more mature market. Related: Crypto gaming has mixed Q1 as deals jump, investment totals dip: DappRadar Mainstream gaming companies are also still experimenting with blockchain-powered games, with Gherghelas pointing to Ubisoft's partnership with Immutable, and Sega adding non-fungible tokens and play-to-earn mechanics to its game, KAI: Battle of Three Kingdoms, as prime examples. “April 2025 wasn’t a record-breaking month for blockchain gaming, and that’s okay. What we’re seeing is a space recalibrating,\" she said. “Speculative hype is cooling down, but the builders haven’t stopped,” she added. ”Games are launching. Ecosystems are expanding. Infrastructure is maturing.”  Magazine: Illegal arcade disguised as … a fake Bitcoin mine? Soldier scams in China: Asia Express Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Canada lags with stablecoin approach, but there’s room to catch up",
        "content": "Crypto industry observers in Canada are concerned that their industry is being left behind without a clear framework for stablecoins. The slow adoption of stablecoins in Canada has some local crypto industry observers concerned that the country is falling behind. The Canadian Securities Administrators (CSA) classified stablecoins as “securities and/or derivatives” in December 2022 after the FTX debacle that shook markets and turned many lawmakers against the crypto industry. Regulating stablecoins as a security has seen few local stablecoin issuers arise, but in the United States and the European Union, softening regulations have seen significant growth in the stablecoin market. This makes Canada, observers say, less competitive with other jurisdictions.  Of particular concern is the perceived gap in peer-to-peer (P2P) payments in Canada, which stablecoins are uniquely qualified to fill.  In 2022, as the crypto market reeled from the collapse of FTX and the implosion of the Terra stablecoin system, regulators worldwide began to look more critically at the crypto space.  In Canada, the CSA updated regulations for crypto exchanges and brought stablecoins under its purview, classifying them as securities/derivatives. This hasn’t been a popular decision with Canada’s crypto industry. Morva Rohani, founding managing director of the Canadian Web3 Council, told Cointelegraph that the CSA’s case-by-case basis for considering stablecoin issuers and the lack of a federal framework make for a “patchwork” regulatory regime. “Canada’s reliance on securities law to regulate payment stablecoins introduces significant legal and operational uncertainty,” she said. Tanim Rasul, chief operating officer of Canadian crypto exchange NDAX, said that the CSA “got it wrong,” stating that other regulatory frameworks, like the EU’s Markets in Crypto-Assets (MiCA) law, were more appropriate. “I would just say, look at MiCA, look at the way they’re approaching stablecoins. It’s a payment instrument. It should be regulated as such,” he told a crowd at the Blockchain Futurist Conference in Toronto on May 13.  It’s not just the EU. Singapore and the UAE have also introduced regulatory frameworks for stablecoins, and US senators are optimistic they will pass a stablecoin law by May 26. Related: What are the next steps for the US stablecoin bill? Rohani said Canada is “out of step with leading global jurisdictions [...] which have adopted tailored, prudential frameworks that recognize stablecoins as payment instruments.” This lack of alignment with other, more pro-stablecoin jurisdictions could have negative effects for the Canadian dollar (CAD), some worry. Som Seif, founder of Canadian investment firm Purpose Financial, said that the proliferation of other major stablecoins, mostly denominated in the US dollar, could threaten the use of the loonie (a nickname for the Canadian dollar) at home. “If Canada does not create the regulatory framework and environment that encourages the development of CAD stablecoins, consumers and businesses will default to using USD-pegged alternatives, eroding the relevance of CAD in global markets,” he said. Members of the Canadian crypto industry have stated that stablecoins have a role to play in the country as well, given the purported lack of P2P payment networks available in the country. Speaking to Cointelegraph on May 13, Coinbase Canada CEO Lucas Matheson said, “It’s really important that we have a stablecoin for Canadians.” He said that the only options currently open were wire transfers, which “cost $45 and take 45 minutes of paperwork.” Rohani said that Interac e-Transfer, a Canadian funds transfer service, “remains the primary domestic P2P rail, operating through banks and credit unions.” Related: Stablecoins seen as ideal fit for real-time collateral management Canada does have apps like PayPal and Wise, which support international P2P transfers, but those often come with high commissions and slow settlement times compared to stablecoins. Rohani said that while some crypto platforms allow for P2P transfers, they’re not widely used due to a lack of integration into mainstream financial services. Demand for more and different digital payment methods is growing in Canada, according to the 2024 digital payments report from Payments Canada, the owner and operator of Canada’s payment clearing and settlement infrastructure. But that demand may not translate directly into stablecoins. Crypto’s “journey towards financial integration among Canadians remains a distant prospect,” the report reads. Some 91% of Canadians have never used crypto as a payment.  Payments Canada attributes the lack of interest to the assets being perceived as the “least secure payment method among Canadians compared to alternatives such as cash, credit cards, cheques, wire transfers and PayPal.” Even in the context of a central bank digital currency, which the crypto industry generally regards as a less favorable option to private, fiat-denominated stablecoins, interest just isn’t there. The survey found that 85% of respondents “did not envision themselves using a digital Canadian dollar and preferred their existing payment methods.” If more tailor-made regulations could integrate stablecoins with the mainstream payment options Canadians are comfortable with, it would still take a concerted effort from policymakers in Ottawa, where the Liberals have just won the federal elections. The crypto industry had cause for doubt. Liberal Prime Minister Mark Carney has previously expressed skepticism about cryptocurrency. In a speech as Governor of the Bank of England, he said they had failed as money.  Still, he acknowledged stablecoins have a role to play in retail and wholesale payments. He said in 2021 that stablecoins should have access to central bank balance sheets — but only if strong protections were in place. “There’s been two systemic crises in money funds in little more than a decade [...] In baseball, it’s three strikes and you’re out. In cricket, it’s only the equivalent of one. For systemic payment systems, one is too many,” Carney stated. Kohani said, “With Mark Carney at the helm of the Liberal Party, we anticipate a pragmatic but regulation-first approach to crypto and stablecoins.” While his previous openness toward stablecoins suggests he’s open to the technology, he also “emphasizes the need for regulation, oversight and safeguards.” Another Liberal term, per Kohani, will likely mean the CSA continues to lead enforcement but could result in broader policy work, including a framework on stablecoins, “particularly if positioned as a tool for payments modernization and maintaining the relevance of the Canadian dollar.”\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Tariff flux pushes brands to bet big on digital merch",
        "content": "Dapper Labs VP Ridhima Kahn told Cointelegraph why digital merch is becoming the go-to strategy for major brands like the NBA, NFL and Disney. As more and more businesses are impacted by tariff volatility, some executives, like Ridhima Kahn, vice president of business development at Dapper Labs, are viewing the assault on the cost of physical goods as another use case for digital markets powered by blockchain to shine. “I’m seeing a lot of brands rethinking where revenue and fan engagement come from,” Kahn said during an exclusive interview with Cointelegraph. “A lot of franchises, like the ones we work with — NBA, NFL, Disney — have already had years of success with digital collection, and we’re seeing a lot of brands express interest in digital collectibles as a way to engage with fan bases at a time when physical costs are riskier and unknown.” Propelling brands to take a deeper look at digital merch is the desire to better understand fandom. Flow now has tradable highlights like a “LeBron Dunk” or a “Steph Curry 3-Pointer” that live inside the NBA app and has commemorative NFTs tied to NFL game highlights in NFL All Day. But with Super Bowl ticket stubs and other digital mementos powered by blockchain, digital goods are proving they can unlock deeper in real life (IRL) fan experiences, courtside or on the field. “When you look at the amount of time folks are spending online or in digital environments, it’s only increasing,” Kahn said. “That’s really motivating brands to identify where their fans are spending time and where they can reach them where they’re at. It’s also a great way to engage a more global fan base simultaneously, versus in a more limiting, geo-targeted way, which caters more toward the global fan bases that want to engage with these brands.” Because fan bases have become more globalized, the online experience just happens to offer a faster, more accessible environment for digital goods, particularly collectibles, versus the current marketplace for physical goods that’s being hampered by enigmatic tariffs. Related: Are Donald Trump’s tariffs a legal house of cards? “Average NFT sales are up 7% quarter-over-quarter, with NFL All Day and NBA Top Shot delivering $2.5 million and $5.6 million, respectively,” Kahn said. “We’re also seeing total value locked (TVL) at an all-time high of $44.4 million on Flow, led by protocols like KittyPunch and other markets that offer next-gen investing and trading opportunities — a trend that’s signaling a broadening use case for blockchain and crypto beyond just NFTs.” Helping broaden the blockchain use case is the recently enhanced onramping and offramping technology that’s permeated throughout the industry, enabling a smoother user experience for those getting started in crypto and the world of digital commodities than what was available three years earlier. Per Kahn: As more defined blockchain regulation is established, companies that might have initially been skeptical of blockchain are now taking it more seriously because regulators are taking it more seriously, helping boost confidence in the tech, especially among well-known brands. “IP-backed collections are winning,” Kahn said. “Upon Flow’s recent integration with OpenSea, NBA Top Shot was ranked among OpenSea’s top-five trending collections for four consecutive weeks. We go deep into specific fan bases to understand user behavior, and we A/B test our experiences, meaning the products we ultimately put out to market for fans are very well-vetted to ensure they’re actually what fans want.” Kahn and Dapper Labs CEO Roham Gharegozlou took a group of VIP collectors during the NBA’s in-season tournament to dinner and openly solicited their opinions on what they wanted to see more of on the platform. It’s the kind of swift, efficient, real-life research and development (R&D) that can more easily impact the end product, because the end product is digital. Related: 4chan rises from the dead: How the imageboard moves crypto markets “We take those insights back to our product team, and we embed those insights into our product to ensure we’re creating the best fan experience, agnostic of the technology we’re using to get there,” Kahn said. “It’s about what the fans want, and we leverage blockchain technology to deliver the fan experiences people might not be able to get elsewhere.” Elsewhere being the physical goods market. “The technology in our products really fades into the background, and what’s left is a collectible that feels meaningful, shareable and valuable,” Kahn said. “Digital collectibles unlock layers of engagement that physical goods cannot: They can be personalized, connected to real-world access, or used to reward loyalty for years and years to come. They’re also remixable, lightweight and global from day one.” But Khan doesn’t believe the physical goods market is going to go by the wayside anytime soon. Outside of the internet, sports and media fans are limited to where they are physically when it comes to purchasing a physical good and where they can take that physical good. But Kahn believes the next evolution of fandom is mobile. “We love the concept of being able to take your most prized possessions with you on your phone, wherever you are,” Kahn said. “Being limited to trading in a physical environment isn’t nearly as fun as being able to trade wherever you are with people all across the world.” Moving forward, Kahn believes brands will continue to expand their playbooks by engaging more with fans in digital spaces. “Consumers are also going to be more willing to adopt new ways to engage with brands in digital spaces if the value proposition is there,” Kahn said. “If we’re able to continue to offer utility to fans for what they do in a digital space — and what they do in a digital space benefits them in a physical world — that’s going to be the recipe for success.” Magazine: Crypto ‘more taboo than OnlyFans,’ says Violetta Zironi, who sold song for 1 BTC Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Five crypto figures who disappeared, died — or maybe didn’t",
        "content": "Some vanished into the ocean, others into thin air. A few weren’t even dead. Zerebro developer Jeffy Yu has been found alive at his parents’ home in San Francisco, days after faking his suicide on a livestream that launched a supposed posthumous memecoin past $100 million. Yu’s case isn’t the first time crypto has blurred the line between real death, faked death and something in between.  From missing founders to sealed caskets, the industry has a long history of exits that left behind more questions than closure. Here are five unsettling cases — real, staged or unresolved — that continue to haunt the crypto world. A clip of Yu broadcasting his “suicide” circulated on May 4. The video showed him smoking a cigarette before pulling the trigger, then the camera dropped. Hours later, a scheduled social media post announced the posthumous launch of LLJEFFY, a memecoin described as his “final art piece.” The coin surged to nearly $105 million in market cap. But Yu wasn’t dead. Blockchain wallets tied to him kept moving. A copy of a letter — allegedly written by Yu — described the exit design as a response to ongoing harassment and blackmail. Reporters from The San Francisco Standard eventually found Yu at his parents’ home. He refused to comment on the suicide stunt or whether he profited from it. In the world of memecoins, this kind of spectacle isn’t new. In late 2024, Pump.fun’s livestream feature triggered a wave of stunts — suicide threats, animal abuse and other shocking acts — to pump token prices. The company shut it down and later relaunched a toned-down version. In February 2025, a suspected Chinese programmer who called themselves Hu Lezhi burned 500 Ether\nETH\n$2,607\n(worth around $1.3 million at the time) and donated another 1,950 ETH (over $5 million) to various groups like WikiLeaks and the Ethereum Foundation.  All of it came with onchain messages alleging that a hedge fund called WizardQuant (aka Kuande Investment) was using “brain-computer weapons” to control its employees — including Hu. Related: 4chan rises from the dead: How the imageboard moves crypto markets The messages read like sci-fi horror. Hu claimed he’d been a mind-control test subject since childhood and warned of a future where humans were nothing more than “puppets or complete slaves to the digital machine.” In one of his last messages, Hu said they would “leave the world” if they reached the final stage of becoming a “complete slave to the digital machine.” Some translated the series of messages as an onchain suicide note. To date, they haven’t re-emerged. And unlike Yu, Hu’s wallet hasn’t moved. On Oct. 28, 2022, DeFi developer Nikolai Mushegian posted a chilling tweet: “CIA and Mossad and pedo elite are running some kind of sex trafficking entrapment blackmail ring… they are going to torture me to death.” By the next morning, he was found face-down in the surf near his beach house in Puerto Rico. Mushegian wasn’t a random crypto kid. He was an early developer at MakerDAO and a key architect of the stablecoin ecosystem.  He was also increasingly paranoid — or, depending on who you ask, increasingly aware. Critics dismissed the tweet as a mental health crisis, but others weren’t so quick to look away. Related: 8 major crypto firms announce US expansion this year The timing of his death sparked a wave of theories: assassination, targeted silencing or even MKUltra-style mind control. Officially, it was ruled an accidental drowning. In December 2018, Gerald Cotten, the 30-year-old founder of Canadian crypto exchange QuadrigaCX, reportedly died in India from Crohn’s disease.  But there was one massive problem: He was the only person with access to $190 million in crypto. As news of his death spread, so did the questions. There was no public autopsy, his death certificate misspelled his name (spelling Cotten as Cottan), the casket was sealed, and a growing army of investors wanted his body exhumed for DNA testing. Quadriga officially declared bankruptcy in 2019. Thousands of clients were locked out of their funds. Eventually, investigators discovered the cold wallets were empty, prompting auditor EY to begin recovery efforts. Some suspected Cotten had run a Ponzi scheme for years and used his death as the ultimate escape plan. The rumors have not been confirmed, but the official story remains that he died a tragic death, as confirmed by Indian authorities.  Self-styled “Cryptoqueen” Ruja Ignatova, co-founder of the $4-billion OneCoin scam, hasn’t been seen since she boarded a Ryanair flight from Sofia to Athens in October 2017. Cotten left no access; Ignatova left no trace. Since then, rumors have swirled. Some say that she underwent plastic surgery and lives under a new identity or that she’s being protected by the Bulgarian mafia.  A Bulgarian investigative outlet claims Ignatova was allegedly murdered in November 2018 on a yacht in the Ionian Sea and that her body was dismembered and dumped overboard under the orders of Bulgarian crime boss Christophoros Amanatidis to cover his ties to OneCoin. More recently, German officials reportedly assumed that Ignatova is in a South African suburb living with private security. Ignatova has been on the US FBI’s 10 Most Wanted list since 2022. Magazine: 10 crypto theories that missed as badly as ‘Peter Todd is Satoshi’ Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Alarm bells ring in US over OpenAI’s crypto project World",
        "content": "OpenAI’s World project is coming to the US, where a state-by-state approach to privacy could complicate user protections. Disclaimer: This article has been updated to reflect that aspects of World are halted in Brazil and Spain, and the project does not hold biomedical markers. Comment from a World spokesperson was also included. World Network, the digital identity and crypto project of Sam Altman’s OpenAI, has alarmed privacy activists ahead of its United States launch, with observers concerned over its data collection and protection practices. World “is the opposite of privacy. It’s a trap,” said Nick Almond, CEO of FactoryDAO, on X. While the project claims to protect user privacy in the age of proliferating AI, it’s faced a slew of regulatory concerns across the globe. Formerly known as “Worldcoin,” the iris-scanning technology and its crypto token payout scheme are being probed by authorities in India, South Korea, Italy, Colombia, Argentina, Portugal, Kenya and Indonesia.  Hong Kong has outright banned it, while Spain and Brazil have paused certain aspects of its operation. World’s latest foray into the US could prove to be CEO Sam Altman’s biggest challenge yet, where privacy concerns are heightened by a patchwork of enforcement that differs state by state. On April 30, Altman announced that World would set up in “key innovation hubs” in five states in the US: Atlanta, Austin, Los Angeles, Miami, Nashville and San Francisco. Would-be verified humans can scan their irises at these hubs, creating a World ID from the unique patterns of their irises. The World ID, based on one's unique eye pattern, can be used to prove one’s humanness when interacting with others on digital platforms.  But as World expands into the US, an uncertain regulatory landscape could put people off and make it difficult for the platform to build user trust.  Andrew Rossow, a cyber and public affairs attorney at Rossow Law, told Cointelegraph, “There is no comprehensive federal law specifically regulating biometric data (such as iris scans) in the US.” Indeed, laws differ state by state. Two states in which World will operate, Texas and California, have some form of legal protections on the books for biometric data. Users in the remaining three states, Georgia, Tennessee and Florida, must rely on federal law, which requires that “companies must be transparent and fair, but there are no special state rules for iris scans.” But even the existence of state law is no guarantee of protection. In Texas, there is no private right of action for biometric data — only the state attorney general (AG) can enforce the state’s Capture or Use of Biometric Identifier law.  Altman announced World’s foray into the US market at a company event two weeks ago. Source: World “The effectiveness of user data protections, as it pertains to World, hinges almost entirely on the Texas AG’s priorities, resources and willingness to act,” said Rossow.  A more aggressive AG could mean more robust protections, while “a less aggressive administration could deprioritize enforcement, which leaves consumers open and vulnerable to exploitation.” The potential for exploitation is one of the key factors driving activist efforts against systems like World.  Privacy International, a privacy protection group that supported legal action in Kenya against World, states that in “the absence of strong legal frameworks and strict safeguards, biometric technologies pose grave threats to privacy and personal security, as their application can be broadened to facilitate discrimination, profiling and mass surveillance.” Related: Over 70 crypto firms join forces to tackle Big Tech’s AI monopoly As far back as 2021, Amnesty International had raised concerns over discrimination and biometric systems’ applications of dubious methodologies. Such systems, they said, can “make inferences and predictions about things such as people’s gender, emotions, or other personal attributes, suffer from serious, fundamental flaws in their scientific underpinnings.” Not everyone is convinced of privacy watchdogs’ concerns. Tomasz Stańczak, co-executive director at the Ethereum Foundation, said that he has spent “over 100 hours” analyzing World, which is building on the Ethereum network. He added that it “looked very promising and much more robust and privacy-focused than my initial intuition.” Paul Dylan-Ennis, an Ethereum researcher and academic, said that he believes World’s tech “is likely strong in privacy terms” but admitted that the aesthetic could be putting people off: “Just some intangible Black Mirror-ness to it all.” OpenAI may be doubling down on an American strategy, but other jurisdictions around the world are increasingly investigating, limiting or outright banning the firm’s activities.  In 2023, regulators in India, South Korea, Kenya, Germany and Brazil began investigating the firm’s data collection practices. Spain became the first country to halt World data collection outright in March 2024.  Related: North Korean spy slips up, reveals ties in fake job interview The Spanish Data Protection Agency previously told Cointelegraph that its course of action was based on reports from Spanish citizens. It claimed that Orb operators provided “insufficient information, collected data from minors and even failed to allow withdrawal of consent.” Following the ban, World published a blog post stating that it operates “lawfully in all of the locations in which it is available.”  World has recently made its iris-scanning orbs more compact and transportable. Source: World Global regulators disagreed. Hong Kong followed Spain in May 2024 and ordered World to cease operations as it was allegedly violating the city-state’s Personal Data Privacy Ordinance. Further accusations of improper data collection practices followed, and a number of countries like Germany and, more recently, Kenya, have ordered World to delete the data of thousands of users, while Colombia and Argentina have issued hefty fines. In January 2025, Brazil’s National Data Protection Authority ordered the firm to stop offering its token to citizens. Regulators cited concern over the irreversible nature of data collection and the potential for World to influence economically disadvantaged people with the promise of crypto for their data. Despite protestations in various countries, the ID system is making inroads. In Japan, World is now a part of dating online.  Spencer Rascoff, CEO of Match Group, which includes dating app Tinder in its portfolio, announced on May 1 that Tinder would be trialing World’s ID system on Tinder in Japan, “giving users a privacy-first way to prove they’re real humans.” The integration in Japan is yet to take off, but as Tinder is the most popular dating app in Japan, it provides a major use case for the World identity platform. In 2024 alone, it had some 1.38 million downloads. If World could score a Tinder partnership in the US, it would acquire 7.8 million monthly active members overnight. If it expanded to similar services like Bumble or Hinge — the next two most popular dating apps in the country — World will have captured 67% of the US online dating market, comprising the personal, unique identities of tens of millions of users.  But privacy rights in the US are far from settled. In Texas, one of the states where World plans to operate, Google recently settled to the tune of $1.4 billion. The company paid the eye-watering sum to the state of Texas after settling two lawsuits alleging the firm of tracking user search and location data, as well as collecting facial recognition information.  Elsewhere, in Illinois and New York, biometrics firms face court proceedings, while lawmakers take measures to curtail the collection of biometric data. Magazine: ChatGPT a ‘schizophrenia-seeking missile,’ AI scientists prep for 50% deaths: AI Eye Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Starknet hits ‘Stage 1’ decentralization, tops ZK-rollups for value locked",
        "content": "Starknet has $629 million in value locked, making it the top ZK-rollup-based layer-2 and reached a decentralization milestone, operating with limited “training wheels.” Ethereum layer-2 scaling platform Starknet has reached a decentralization milestone laid out by Ethereum co-founder Vitalik Buterin and is now the largest zero-knowledge rollup-based network by total value locked. Starknet said in a press release shared with Cointelegraph that it has hit “Stage 1” decentralization, according to a framework Buterin laid out in 2022, which means the network operates with limited oversight or “training wheels.” Starknet added that the framework was the “gold standard onchain tool for analyzing Ethereum scaling solutions,” and said it achieved the milestone through changes such as creating a security council and censorship-avoidance mechanisms.  While the system still allows intervention from a security council, it has implemented a fully functional validity proof system governed by smart contracts. Starknet is now the only layer-2 ZK-rollup network to have reached Stage 1 and has grown to be the largest ZK-rollup blockchain with a total value locked of $629 million, just ahead of ZKsync’s $610 million, according to L2beat.  Starknet is the fifth-largest layer-2 network by value locked, with the top four all Optimistic rollup-based and all reached Stage 1 decentralization using fraud proofs.  Fraud proofs assume transactions are invalid until proven valid, while validity proofs assume transactions are valid only if proven valid with cryptographic evidence. “Our goal is for the training wheels to come off completely and to reach Stage 2 decentralization on Ethereum, and simultaneously steam forward with our work on Bitcoin too,” said Eli Ben-Sasson, co-founder and CEO of StarkWare, the developer behind Starknet.  “Stage 2” decentralization is the point where the network will be fully autonomous and community-governed. Only three small layer-2 scaling platforms have reached this stage, according to L2beat.  Related: Vitalik Buterin says rollups must prove security before decentralizing Buterin introduced the concept of “training wheels” or three stages for Ethereum scaling rollup projects at various phases of development in 2022. The Coinbase layer-2 network Base is the leader of the sector in terms of value locked, with $14.7 billion, giving it a market share of 33%. Comparatively, Starknet has a market share of 1.4%.  The total value secured onchain in the layer-2 ecosystem is $44.2 billion. The figure has jumped recently as the value of Ether\nETH\n$2,608\nhas gained, but is down 20% so far this year. Magazine: Metric signals $250K Bitcoin is ‘best case,’ SOL, HYPE tipped for gains: Trade Secrets Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    }
]