[
    {
        "title": "Avalanche-backed Fusion launches with $100M to boost blockchain adoption",
        "content": "Avalanche, Helix and Faculty Group launch Fusion, a $100 million initiative to build modular, sector-specific blockchain networks. Avalanche, Helix and Faculty Group have launched Fusion, a new blockchain ecosystem aimed at driving real-world adoption through modular infrastructure tailored to specific industries. Built on Avalanche, Fusion features a two-layer architecture that includes composers, customizable layer-1 networks and modules, which offer plug-and-play services like compute, identity and data oracles.  The team said this approach would be the answer for mainstream adoption, as they attempt to deliver “outcome-driven, domain-specific” blockchain-based economies.  “In order to achieve widespread adoption, our industry needs to shift from selling blockspace to delivering business value,” a Fusion spokesperson told Cointelegraph. They added that Fusion integrates economic alignment, network design and composability to achieve real-world outcomes.   The Fusion team expects composers and modules — the two building blocks for the protocol — to gain traction in the next two to three years.  The spokesperson told Cointelegraph that they are starting with five composers and nearly 100 modules in the first year. The team expects this to more than double over the next two to three years. “Because of how the ecosystem is designed, in two to three years we expect that the Fusion ecosystem will consist of tens of composers and hundreds of modules,” the spokesperson said. Fusion’s architecture is designed to let enterprises and Web3 builders combine technology, financial tools, and identity features in ways that were previously unavailable, the spokesperson added. “Fusion is an initiative led and funded by the Avalanche community that is only technologically possible on Avalanche,” the spokesperson said, claiming that the initiative strengthens Avalanche’s position as a blockchain that delivers real-world business value.  Related: Indonesia’s DigiAsia shares pop 90% on plan to raise $100M to buy Bitcoin The project is funded by resources allocated in existing Avalanche programs. According to Fusion’s announcement, the funds will come from Avalanche’s Multiverse, an incentive program to accelerate the adoption of Avalanche subnets, and Retro9000, a grant program that rewards developers who build infrastructure and tools. Fusion also uses funds from InfraBUIDL and InfraBUIDL AI, programs designed to fund Avalanche-based projects.  “The funds will be distributed to support the medium-term growth of the Fusion ecosystem, including composers, modules and end-users,” the spokesperson told Cointelegraph. Magazine: Father-son team lists Africa’s XRP Healthcare on Canadian stock exchange Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "India’s Supreme Court urges government to regulate cryptocurrency",
        "content": "India’s Supreme Court questioned the government’s failure to regulate cryptocurrencies despite taxing them, warning that Bitcoin and similar assets pose economic risks. India’s Supreme Court questioned the government’s lack of regulatory clarity on cryptocurrencies despite imposing taxes on digital assets like Bitcoin. According to the Indian legal news outlet LawChakra, the country’s Supreme Court expressed concern over the increasing use of Bitcoin (BTC) and other cryptocurrencies, which remain largely unregulated. “This is a whole parallel economy running with such coins, and it is a danger to the economy of the country,” Justice Surya Kant reportedly said during a recent hearing related to an ongoing investigation into a Bitcoin transaction. Kant said that while the government has implemented crypto taxation, it has failed to regulate the space. “If you can tax it at 30%, also please regulate it as you have recognised it by taxing it,” the judge said. Related: Indian high court orders steps to block Proton Mail The Additional Solicitor General of India — a senior legal officer representing the government of India — reportedly answered the request by saying that the government “will take instructions, my lord,” indicating that the government may consider reviewing the country’s current cryptocurrency regulation. The report follows a May 5 hearing by the Supreme Court during which Kant and lawyer Mahesh Jethmalani shared their views on cryptocurrency. Jethmalani said that Bitcoin is already being used worldwide, noting that “in Europe, you can walk into a car showroom and buy a car using just one Bitcoin.” Related: Coinbase plans India comeback with FIU registration While this scenario is not as common as this statement may suggest, buying a car with Bitcoin is possible at specialized sellers. The lawyer also showed that he misunderstood the pseudonymous nature of Bitcoin’s creator, Satoshi Nakamoto, claiming that he was from Japan: Kant also expressed concern over the misuse of cryptocurrencies. He said that “there is some system of rules that applies to this.” Kant also said that “some Bitcoins are genuine, but some might not be.” However, it’s unclear whether he meant to suggest that counterfeit Bitcoin are in circulation (there are none) or that illegal activities taint some. The latter appears likely since the statement was followed by the judge saying that “it has also become a possible way to do illegal business.” India’s government has not yet introduced comprehensive legislation to govern cryptocurrencies, though it taxes gains and requires firms to report certain activities to financial regulators. The lack of regulation has drawn criticism from both the industry and policymakers amid the asset class’s continued growth. Magazine: India mulls new crypto ban to support CBDC, Lazarus Group strikes again: Asia Express Explore more articles like this Subscribe to the Cointelegraph Research Newsletter Select the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "From rebels to recognition: Crypto’s path into conservative portfolios",
        "content": "What began as a rebellious alternative is now being integrated into the mainstream, including the portfolios that once ignored it. Driven by institutional adoption, stable infrastructure and familiar financial mechanisms, digital assets are shifting from speculative ventures into trusted components of conservative portfolios, marking crypto's maturation and broader mainstream financial integration. Cryptocurrencies were born as rebels, but they’re maturing into something far more familiar: a respectable addition to conservative investment portfolios. When Bitcoin\nBTC\n$104,695\ndebuted during the financial crisis of 2008, it was pitched as a radical alternative, promising decentralization and independence from traditional monetary systems. But today, crypto assets are quietly following a path already traveled by stocks, bonds and commodities, transforming from speculative bets into stable investment options. Historically, skepticism greeted every new asset class. Stocks, once considered highly speculative in the early 20th century, were dismissed as volatile gambles only to become integral additions in the portfolios later, while bonds took decades to earn their reputation as a safe haven. Crypto is now entering this same acceptance stage, as institutional investors (including pension funds, asset managers and family offices) allocate portions of their portfolios to digital assets, recognizing them as potential hedges against inflation and financial instability. At first glance, cryptocurrencies’ appeal to conservative investors may seem counterintuitive. However, the infrastructure behind is capable of providing experiences remarkably similar to traditional financial instruments. Stablecoins, pegged to currencies like the US dollar, provide the benefits of blockchain technology without wild price swings, becoming an attractive gateway for risk-averse investors. Their adoption is rapidly growing as they offer investors a familiar, fiat-like experience, but with the additional benefits of blockchain technology, such as rapid settlement and transparency. Moreover, the rise of platforms offering insured crypto custody and deposit-based rewards has significantly boosted confidence. These platforms echo traditional banking services, complete with regulated oversight, robust security and familiar mechanisms such as withdrawal flexibility and comprehensive asset protection. For example, CoinDepo, a crypto staking platform, illustrates how crypto has adapted to conservative financial expectations. Founded in 2021 and managing over $125 million in crypto assets for more than 55,000 users across 220 jurisdictions, CoinDepo provides an insured environment to securely hold crypto assets while earning stable rewards. 🌍✨ Together, We Can Make a Difference! ✨🌍\n\nCheck out this quick video about our CoinDepo Charity Project with the Damark Charity Foundation (https://t.co/mebnWe8mF3) – a powerful initiative driven by our belief in positive change! Join us in making an impact on the world, one… pic.twitter.com/baE42BYx5I Unlike typical crypto offerings that lock funds indefinitely, CoinDepo ensures full liquidity, allowing users immediate access to their crypto in case of emergencies. Supported by extensive insurance coverage and Fireblocks, a leading custodial provider for banks and financial institutions, it further aligns with traditional investor expectations. Additionally, the platform aims to launch crypto-backed credit cards integrated with Apple Pay and Google Pay by the end of 2025, delivering up to 8% cashback on purchases. The cards will be accepted by over 90 million merchants globally, allowing seamless utility in daily life. Choose a CoinDepo Crypto Credit Card and earn up to 8% cryptocurrency cashback 💳\n⁰📌 Join the waitlist now & get a 500 USDC bonus after spending $3,000 within the first 3 months⁰⁰Why choose CoinDepo Credit Card?⁰🔸Monthly ATM withdrawal limit up to $10,000\n🔹No origination /… pic.twitter.com/0uFrlbRptn CoinDepo is also preparing to list its native token soon, which is currently in the Pre-sale stage, further integrating its ecosystem into mainstream crypto markets and expanding opportunities for user engagement. As crypto adoption increases, what once seemed radical is becoming routine. Bitcoin is frequently compared to gold and referred to as digital gold, indicating the seriousness with which it's being regarded. The gradual embrace of digital assets in the finance industry is partly driven by increased regulatory clarity and institutional-grade infrastructure. Major financial institutions, once hesitant to engage with crypto, now offer products specifically designed for digital asset exposure. These changes reassure conservative investors who historically avoided crypto, allowing digital assets to take a meaningful place alongside bonds, equities and real estate in balanced portfolios. This evolution signals crypto’s coming of age. By mirroring traditional asset trajectories — complete with familiar safeguards, reliable infrastructure and practical real-world use cases — crypto is no longer just for speculators. It's now an integral part of modern investment strategies, bridging the gap between digital innovation and trusted financial tradition. Learn more about CoinDepo Disclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice. Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Binance seeks to dismiss $1.76B FTX lawsuit, blames SBF for collapse",
        "content": "Binance is pushing to dismiss a $1.76 billion lawsuit filed by FTX, claiming the suit wrongly blames Binance and former CEO Changpeng Zhao for a collapse caused by internal fraud. Binance has filed a motion to dismiss a $1.76 billion lawsuit brought by the FTX estate, accusing the defunct crypto exchange of trying to deflect blame for its own failure. Filed on May 16 in the Delaware Bankruptcy Court, Binance’s legal team called the suit “legally deficient,” stating that FTX’s collapse was not triggered by market manipulation or hostile action but by internal misconduct. “Plaintiffs are pretending that FTX did not collapse as the result of one of the most massive corporate frauds in history,” the filing said, pointing to Sam “SBF” Bankman-Fried’s conviction on seven counts of fraud and conspiracy. FTX’s estate alleges that Binance received billions in crypto during a 2021 buyback deal, funded improperly with customer assets. Binance rejects this claim, stating that “FTX remained a going concern for 16 months” after the share repurchase and that there was “no plausible claim” the exchange was insolvent at the time. Related: Binance wants arbitration for all members of securities class suit The lawsuit also accuses former Binance CEO Changpeng Zhao of triggering a collapse through a tweet on Nov. 6, 2022 announcing the liquidation of FTT tokens. In response, Binance argued that Zhao’s tweet was based on publicly known concerns. “Binance’s decision to liquidate its remaining FTT was, in fact, ‘due to recent revelations ’— in particular, the Nov. 2, 2022, CoinDesk article” that exposed Alameda Research’s balance sheet. The company further defended Zhao’s comment that Binance would aim to minimize market impact. “The Complaint contains no such facts” to prove Binance had no intention of following through. In challenging the court’s jurisdiction, Binance said none of the foreign entities named “are incorporated in or maintain their principal place of business in the United States,” and thus fall outside the court’s reach. The filing also criticizes the plaintiff’s narrative as “a grab bag of state law claims” based on “pure conjecture — much of it sourced from a convicted fraudster’s hindsight speculation.” Binance has asked the court to dismiss all claims with prejudice. The FTX estate has not yet filed its response. Related: FTX EU creditors can now withdraw money from Backpack exchange FTX is set to begin its second round of repayments to creditors more than two years after filing for bankruptcy. In a May 15 notice, the FTX Recovery Trust announced that over $5 billion will be distributed starting May 30 through BitGo and Kraken, targeting parties in the second eligible group under the exchange’s reorganization plan. According to the plan, five creditor groups categorized as “convenience classes” are expected to receive between 54% and 120% of their claims. In total, FTX may repay up to $16 billion, depending on the final number of valid claims. Magazine: Father-son team lists Africa’s XRP Healthcare on Canadian stock exchange Explore more articles like this Subscribe to our Crypto Biz newsletter Weekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Bitcoin privacy tool Payjoin receives $100K grant from Maelstrom",
        "content": "Maelstrom has awarded Bitcoin developer Ben Allen a $100,000 grant to improve Payjoin, a privacy-focused transaction method that could boost Bitcoin scalability. Bitcoin developer Ben Allen has received a $100,000 grant from investment firm Maelstrom to support the development of Payjoin, a privacy-focused tool aimed at improving Bitcoin’s scalability and privacy. According to a May 20 announcement shared with Cointelegraph, Maelstrom will finance Allen’s work on his Payjoin devkit alongside Dan Gould. The system allows Bitcoin\nBTC\n$104,695\nsenders and receivers to use batched transactions, with positive implications for scalability and privacy. Payjoin was first proposed by Nicolas Dorier in 2019 in Bitcoin improvement proposal (BIP) 78. The core principle behind the system is that both senders and receivers may contribute inputs to a transaction. “Namely that privacy is enhanced and improved consolidation of transaction outputs is achieved, benefiting scalability,“ the Maelstrom announcement states. A Maelstrom representative told Cointelegraph that grantees are paid monthly for a total of $100,000 per year in Bitcoin and Allen’s grant will last one year. There are no concrete milestones and the grant is managed on a hands-off approach: Related: Bitcoin privacy will survive despite CoinJoin closure — zkSNACKs CEO Allen will be working on improving Payjoin implementations, with the clear objective of making it possible for the feature to be added to more wallets. He explained that the funding will enable him to work on the project full time. The announcement points out that the system presents challenges, with the receiver needing to be online and the payment communication flow being more complex than normal non-interactive Bitcoin transactions. Maelstrom’s chief investment officer and BitMEX crypto exchange co-founder and former CEO Arthur Hayes said that “improving financial privacy in Bitcoin is extremely important.” He added: A Maelstrom representative explained to Cointelegraph that the firm “is keen to support more grantees in the privacy area.” The company is actively seeking candidates with strong track records in Bitcoin privacy projects. Related: What are privacy coins and how do they differ from Bitcoin? Hayes noted that “Payjoin adoption improves the privacy of even the people who don’t use it.” Allen said he believes privacy is important for Bitcoin users to enjoy a better experience and control their financial data when using it daily. Allen told Cointelegraph he is “building out benchmarks to help downstream developers implement Payjoin in individual wallet software as well as expanding test coverage to ensure consistent and reproducible code.” He explained that encouraging its adoption “is the biggest step we can take for simplifying the experience and encouraging Payjoin adoption by moving the complexities mostly away from the user.” The Maelstrom representative told Cointelegraph that “a key metric for Payjoin success would be adoption by popular open source Bitcoin wallets.” “In particular if the BitcoinCore wallet ever adopts it, that would be a huge signal of success,” they added. Magazine: Big Questions: What did Satoshi Nakamoto think about ZK-proofs? Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Bitcoin is signaling a golden cross — What does it mean for BTC price?",
        "content": "Most recent Bitcoin golden crosses have triggered major rallies, though not without notable failures like the February 2020 bull trap. Key takeaways: Bitcoin is nearing a golden cross that led to 45–60% price rallies in the recent past. Fundamentals like rising M2 supply and easing trade tensions support a bullish outlook. Bearish divergence and overbought conditions show there’s still a risk of BTC falling below $100,000. Bitcoin\nBTC\n$104,695\nwill likely confirm a “golden cross” on its daily chart by the end of May, a technical pattern whose occurrences in recent years often preceded rallies. As of May 20, Bitcoin’s 50-day simple moving average (50-day SMA; the red wave) was eyeing a close above its 200-day SMA (the blue wave) for the first time since October 2024, forming a golden cross. Previously, BTC price had gained over 60%, with the reelection of Donald Trump as the US president playing a key role. In October 2023, the golden cross was followed by a 45% BTC price rally, helped by Bitcoin ETF euphoria. September 2021 saw 50% gains in BTC price after painting a similar SMA crossover. Using indicators that worked in the past is not a guaranteed strategy. Traders learned that in February 2020, when Bitcoin’s golden cross preceded a 62% price crash, primarily due to the global market rout led by the COVID-19 lockdowns. That episode underscores the importance of using golden crosses with broader technical and macro indicators while factoring in the possibility of unexpected events. As of now, Bitcoin’s upcoming golden cross aligns with mostly supportive fundamentals, placing the signal on the bullish side of the ledger. Increasing M2 money supply and easing US-China trade tensions, for instance, have propelled bets on a new record high for Bitcoin. What’s notable this time is that BTC is signaling a correction after its relative strength index (RSI) crossed above the overbought threshold of 70 earlier in May. Related: Bitcoin trading in six-figure territory shows BTC is ready to carry gold’s ‘baton’ — Fidelity exec So, instead of an immediate rally after the cross, Bitcoin may initially pull back toward its SMA supports, sitting around the $92,400-95,000 range as of May 20. A growing bearish divergence between the rising Bitcoin price and falling RSI furthers the chances of short-term downside. Nonetheless, some technical indicators see the BTC price rallying toward $150,000 in the coming months. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "A Bitcoiner’s guide to South Africa’s Garden Route",
        "content": "There are few places on Earth as Bitcoin-friendly as the scenic Garden Route in South Africa, where Bitcoin circular economies have blossomed. South Africa’s Garden Route, famed for its lush forests, expansive beaches and charming towns, has become a testbed for Bitcoin adoption. From Mossel Bay to Witsand and Plettenberg Bay to Knysna, Bitcoin has become popular among shop owners and travelers alike for a multitude of reasons. “We’re seeing the early signs of a parallel, permissionless economy emerging across an entire region,” James Caw, founder of SimplB — a local crypto asset provider — told Cointelegraph, “where small businesses benefit from faster, lower-cost digital payments and where people have more options to earn, send and receive sound money securely.” For tourists, the benefits are immediate: no currency exchange hassles, no international card fees, and the ability to pay instantly and securely. For locals, Bitcoin\nBTC\n$104,695\noffers a hedge against inflation, protection from currency volatility and new economic opportunities. Here’s a taste of what a Bitcoin-friendly trip along the Garden Route is like. The Garden Route is one of South Africa’s premier tourist corridors. It stretches roughly 300 kilometers from Mossel Bay in the west to the Storms River Mouth in the east, attracting hundreds of thousands of tourists yearly. Crypto adoption is escalating thanks to South Africa’s regulatory environment, which now recognizes Bitcoin as a financial product. Across the Garden Route, you can spend pre-acquired Bitcoin freely, with little concern for local tax or exchange controls. It’s a grassroots movement. Towns like Witsand and Plettenberg Bay are at the forefront, and national retailers like Pick n Pay provide a safety net for crypto spending along the way. Every Pick n Pay store, including supermarkets, clothing outlets and Express convenience stores, accepts Bitcoin via the CryptoQR app. This guarantees you can always buy daily goods with Bitcoin wherever you travel.  Related: Stablecoin fever: 5 major stablecoins are growing crypto adoption Located at the mouth of the Breede River, Witsand is a sleepy coastal town with a big reputation in the Bitcoin world. Here, Bitcoin isn’t just accepted — it’s preferred. It’s thanks to the efforts of local champions like Edwin Jones, a software engineer and passionate supporter of Bitcoin adoption in the Garden Route. Witsand has become a functioning Bitcoin circular economy. Accommodation options like Fantasea and Happy Days holiday homes, meals at Ellie’s on Main, groceries at local shops, gym memberships, boat services, petrol, surf lessons and mini-golf can be paid for using Bitcoin. As Jones notes:  The town’s small and close-knit community has enabled rapid adoption; more than 45 establishments accept Bitcoin as of early 2025. The town’s enthusiasm is infectious, as locals and visitors enjoy the ease and security of digital payments. Witsand’s success as a Bitcoin hub is rooted in its community-driven approach. Jones outlines its growth by outlining that:  “With the Lightning Network starting to reach maturity around that time, the first Spaza Shop in Mossel Bay, Bitcoin Ekasi, started accepting Bitcoin in August 2021, and the first restaurant in Witsand in December of the same year.” Education has been central to the process. Local advocates have focused on teaching business owners the fundamentals of Bitcoin, warning against scams and emphasizing the difference between Bitcoin and speculative altcoins.  “With all the circular economies advocating against gambling and trading, cautioning against interest and investments, being explicitly Bitcoin, and focusing on the fundamentals rather than the price, scammers have been kept at bay,” Jones said. “We have also found that businesses don’t have to adapt as much as evolve.” Mossel Bay, the historical gateway to the Garden Route, is not just about beaches and maritime history. Mossel Bay is home to Bitcoin Ekasi, a pioneering project that brought Bitcoin to the township of JCC Camp. Bitcoin Ekasi empowers unbanked residents by enabling them to earn and spend Bitcoin locally. Coaches at The Surfer Kids nonprofit are paid in Bitcoin, and local spaza shops accept Bitcoin for daily necessities. For the Bitcoiner tourist, Mossel Bay offers a unique opportunity for “conscious crypto-tourism.” You can take surf lessons from instructors paid in Bitcoin, visit the Bitcoin Ekasi education center, or support the project with direct donations. The town also boasts a Pick n Pay that accepts Bitcoin. As SimplB’s Caw observes:  Further east, Plettenberg Bay has witnessed an explosion in Bitcoin adoption. In just a few months, the number of Bitcoin-accepting merchants jumped from five to more than 75, making it one of Africa’s most dynamic crypto economies. Confirmed acceptors include Ferris Cars (which facilitates rental accommodation payments in crypto), Glow Lighting Design and all local Pick n Pay branches. Adventure tourism companies, boutique retailers and professional services are increasingly receptive to Bitcoin, especially if you ask. The rapid growth suggests an enthusiastic local scene, with businesses eager to tap into the spending power of Bitcoin tourists. Related: 8 major crypto firms announce US expansion this year Plettenberg Bay offers a vibrant mix of beach life, nature and crypto-friendly commerce. The town’s energy is palpable, and visitors are encouraged to engage with merchants, share information about Lightning payments, and help grow the ecosystem. “Right now Plettenberg Bay is by far the most interesting circular economy in Africa and possibly the world,” said Jones. “It currently boasts having the most businesses accepting Bitcoin of any town in Africa and has achieved this in less than three months.” Sedgefield, a tranquil town between Knysna and Wilderness, played a key role in the national rollout of Bitcoin payments at Pick n Pay. It was one of the trial sites for the innovative QR code converter from MoneyBadger, which enables Bitcoin spending at every Pick n Pay in South Africa. Sedgefield itself doesn’t have the same density of Bitcoin-accepting independent merchants as Witsand or Plettenberg Bay, but the presence of Pick n Pay ensures that crypto tourists can always pay for groceries and essentials with sats. If you do make it out to the Garden Route, recommended wallets include Blink, Wallet of Satoshi and Phoenix — all Lightning-enabled and widely used in the region.  In larger towns like Knysna, George, Wilderness and Oudtshoorn, the Bitcoin scene is still emerging. There aren’t yet established circular economies, but the nationwide acceptance of Bitcoin at Pick n Pay provides a reliable foundation for spending. BTC Map occasionally lists independent merchants, like Beans About Coffee in Oudtshoorn. Still, the best strategy is to ask around, look for Bitcoin signage, and use mapping tools to discover new acceptors. For accommodation, activities and dining, direct inquiry remains key. Many guesthouses and tour operators are open to Bitcoin payments, especially as awareness grows. Online platforms like Bitrefill enable you to buy gift vouchers for major retailers using Bitcoin, providing a workaround for places that don’t yet accept crypto directly. Happy travels. Magazine: Pranksy: Inside the anonymous life of an NFT legend — NFT Collector Explore more articles like this Subscribe to our Crypto Biz newsletter Weekly snapshot of key business trends in blockchain and crypto, from startup buzz to regulatory shifts. Gain valuable insights to navigate the market and spot financial opportunities. Delivered every Thursday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Violent crypto robberies on the rise: Six attacks that targeted investors",
        "content": "A recent spate of violent attacks on crypto investors has authorities concerned about public safety. As cryptocurrency gains in popularity and price, some criminals are taking to violent measures to steal funds from high-profile crypto holders. Jameson Lopp’s GitHub repository, which logs such incidents, has recorded 22 “$5 wrench” attacks on crypto holders in 2025 alone. The moniker comes from the crude and violent methods perpetrators use to compel crypto holders to hand over their bags.  In many cases, local law enforcement can intervene before anyone is harmed and funds are lost. But there is a growing trend of increasingly violent and successful attacks, some of which have resulted in permanent harm and even death. The most recent incident in Paris, France compelled the French Ministry of the Interior to hold a meeting to address the rising trend. Here are just seven of the most high-profile attacks this year. The founder of crypto wallet Ledger, David Balland, and his wife, Amandine Balland, were kidnapped from their home on Jan. 21. The couple was put in a car, then separated and held at different locations.  Paris prosecutor Laure Beccuau said that the kidnappers called an executive at Ledger and demanded a substantial ransom to be paid in cryptocurrencies. They reportedly mutilated Balland’s hand and sent Ledger a photograph to put pressure on the company. Some 230 officers participated in the search after Ledger alerted authorities. The police managed to locate and free David on Jan. 22 in Châteauroux, 30 miles southwest of his residence. One day later, after questioning arrested suspects and analyzing phone records, police were able to locate and rescue Amandine in Étampes, 80 miles north of Vierzon. A small portion of the ransom was paid. Beccuau said it was frozen and tracked, leading to the arrest of nine men and one woman.  On Jan. 20, Korean Bitcoin (BTC) trader Taehwa Kim met with a man under the alias “JC” in Makati City, Philippines who was supposedly interested in buying his Lamborghini. After a test drive, they stopped at a spa, supposedly to meet with JC’s lawyer. Three other men forced Kim into another vehicle and bound his hands.  Kim was kept for three days. Then, the attackers abandoned him some 50 kilometers away, his hands still tied, where police officers found him. The perpetrators didn’t manage to get his crypto, but they stole his car, his Rolex watch, his wallet and the keys to his house.  In November 2024, Kick streamer and cosplayer Kaitlyn Siragusa, known professionally as “Amouranth,” posted a screenshot on X of her crypto wallet. It held some $20 million in Bitcoin (BTC) and $80,000 in Ether (ETH).  Months later, on March 2, 2025, three armed assailants allegedly broke into her home with the intent of stealing her cryptocurrency. She posted during the incident on X, stating, “I’m being too robbed at gunpont. I believe I shot one of them they wanted crypto is what they were yelling they pulled me out of bed.” Siragusa claimed that the assailants physically assaulted her before she discharged a weapon, after which they fled the scene. She said that police were testing blood left by suspects at the scene and posted video of the incident on her X profile.  On March 29, police in São Paulo arrested a retired military police officer in connection with the week-long kidnapping of a Spanish businessman.  Speaking to authorities, the businessman said he was approached by two men dressed in fake civil police uniforms and forced into a truck. Upon reaching a secluded location on the outskirts of the city, the assailants held him and demanded $50 million in cryptocurrency. Local media said the kidnappers drugged their victim with sleeping pills, but he was still able to escape when one of them went to the bathroom. After finding a filling station, he tipped off police, who seized one of the suspects as well as a pistol and ammunition.  The daughter and grandson of Pierre Noizat, co-founder and CEO of French crypto exchange Paymium, narrowly escaped a kidnapping attempt in Paris when passersby intervened. Three masked attackers tried to force Noizat’s daughter and her son into a van while they were taking a walk in Paris on May 13.  En plein Paris, un homme a été violenté par des individus cagoulés, habillés tout en noir. Ils tentaient de l'enlever. Un homme a surgi, extincteur à la main, pour les faire fuir. →https://t.co/P0qV6PR40v pic.twitter.com/9f4r2Gi7ho Noizat’s daughter managed to disarm an attacker, after which a passing crowd intervened. The assailants fled in a van, which was later found abandoned nearby. The victims sustained injuries and were evacuated to a local hospital. Local media reported that the Brigade for the Suppression of Banditry, a special police unit of the French Ministry of the Interior, was investigating the incident.  Kidnappers in Paris, France abducted the father of a French cryptocurrency entrepreneur on May 4.  The attackers took him to Essonne, 35 miles away from the Paris street where they grabbed him, and cut off his finger. They made a video and sent it to his son, demanding 5 million euros in crypto. The victim’s son subsequently contacted police.  The victim was held for two days before French police were able to find and rescue him. According to CNN, five people were arrested in connection with the kidnapping.  Authorities have noted the striking similarities of the case to that of Balland, whose attackers also took him several miles from the city and mutilated his hand.  “Obviously, there’s at least a link in the modus operandi. Now, whether it’s the same team or not is for the investigators to say,” said internal security expert Guillaume Farde. The rise in recent attacks has shaken the crypto industry. Ben Davis, co-founder and CEO at blockchain insurance firm Native, told Cointelegraph, “We used to see crypto wrench attacks predominantly happening when executives were abroad or traveling. However, high-profile cases like the kidnapping of Ledger’s co-founder show that attackers are now targeting individuals in their own homes, with more planning and precision than ever before.” Authorities are responding to concerns as well. On May 16, the French Interior Minister Bruno Retailleau met with cryptocurrency professionals to address the recent uptick in violent crime against industry figures.  For the foreseeable future, personal security, not just asset security, will be a defining theme of the crypto industry.  Magazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee Additional reporting by Cath Jenkin Explore more articles like this Subscribe to the Cointelegraph Research Newsletter Select the Cointelegraph newsletters to which you would like to subscribe to receive the latest news and analysis directly from our team. Delivered on Wednesdays By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Canada lags with stablecoin approach, but there’s room to catch up",
        "content": "Crypto industry observers in Canada are concerned that their industry is being left behind without a clear framework for stablecoins. The slow adoption of stablecoins in Canada has some local crypto industry observers concerned that the country is falling behind. The Canadian Securities Administrators (CSA) classified stablecoins as “securities and/or derivatives” in December 2022 after the FTX debacle that shook markets and turned many lawmakers against the crypto industry. Regulating stablecoins as a security has seen few local stablecoin issuers arise, but in the United States and the European Union, softening regulations have seen significant growth in the stablecoin market. This makes Canada, observers say, less competitive with other jurisdictions.  Of particular concern is the perceived gap in peer-to-peer (P2P) payments in Canada, which stablecoins are uniquely qualified to fill.  In 2022, as the crypto market reeled from the collapse of FTX and the implosion of the Terra stablecoin system, regulators worldwide began to look more critically at the crypto space.  In Canada, the CSA updated regulations for crypto exchanges and brought stablecoins under its purview, classifying them as securities/derivatives. This hasn’t been a popular decision with Canada’s crypto industry. Morva Rohani, founding managing director of the Canadian Web3 Council, told Cointelegraph that the CSA’s case-by-case basis for considering stablecoin issuers and the lack of a federal framework make for a “patchwork” regulatory regime. “Canada’s reliance on securities law to regulate payment stablecoins introduces significant legal and operational uncertainty,” she said. Tanim Rasul, chief operating officer of Canadian crypto exchange NDAX, said that the CSA “got it wrong,” stating that other regulatory frameworks, like the EU’s Markets in Crypto-Assets (MiCA) law, were more appropriate. “I would just say, look at MiCA, look at the way they’re approaching stablecoins. It’s a payment instrument. It should be regulated as such,” he told a crowd at the Blockchain Futurist Conference in Toronto on May 13.  It’s not just the EU. Singapore and the UAE have also introduced regulatory frameworks for stablecoins, and US senators are optimistic they will pass a stablecoin law by May 26. Related: What are the next steps for the US stablecoin bill? Rohani said Canada is “out of step with leading global jurisdictions [...] which have adopted tailored, prudential frameworks that recognize stablecoins as payment instruments.” This lack of alignment with other, more pro-stablecoin jurisdictions could have negative effects for the Canadian dollar (CAD), some worry. Som Seif, founder of Canadian investment firm Purpose Financial, said that the proliferation of other major stablecoins, mostly denominated in the US dollar, could threaten the use of the loonie (a nickname for the Canadian dollar) at home. “If Canada does not create the regulatory framework and environment that encourages the development of CAD stablecoins, consumers and businesses will default to using USD-pegged alternatives, eroding the relevance of CAD in global markets,” he said. Members of the Canadian crypto industry have stated that stablecoins have a role to play in the country as well, given the purported lack of P2P payment networks available in the country. Speaking to Cointelegraph on May 13, Coinbase Canada CEO Lucas Matheson said, “It’s really important that we have a stablecoin for Canadians.” He said that the only options currently open were wire transfers, which “cost $45 and take 45 minutes of paperwork.” Rohani said that Interac e-Transfer, a Canadian funds transfer service, “remains the primary domestic P2P rail, operating through banks and credit unions.” Related: Stablecoins seen as ideal fit for real-time collateral management Canada does have apps like PayPal and Wise, which support international P2P transfers, but those often come with high commissions and slow settlement times compared to stablecoins. Rohani said that while some crypto platforms allow for P2P transfers, they’re not widely used due to a lack of integration into mainstream financial services. Demand for more and different digital payment methods is growing in Canada, according to the 2024 digital payments report from Payments Canada, the owner and operator of Canada’s payment clearing and settlement infrastructure. But that demand may not translate directly into stablecoins. Crypto’s “journey towards financial integration among Canadians remains a distant prospect,” the report reads. Some 91% of Canadians have never used crypto as a payment.  Payments Canada attributes the lack of interest to the assets being perceived as the “least secure payment method among Canadians compared to alternatives such as cash, credit cards, cheques, wire transfers and PayPal.” Even in the context of a central bank digital currency, which the crypto industry generally regards as a less favorable option to private, fiat-denominated stablecoins, interest just isn’t there. The survey found that 85% of respondents “did not envision themselves using a digital Canadian dollar and preferred their existing payment methods.” If more tailor-made regulations could integrate stablecoins with the mainstream payment options Canadians are comfortable with, it would still take a concerted effort from policymakers in Ottawa, where the Liberals have just won the federal elections. The crypto industry had cause for doubt. Liberal Prime Minister Mark Carney has previously expressed skepticism about cryptocurrency. In a speech as Governor of the Bank of England, he said they had failed as money.  Still, he acknowledged stablecoins have a role to play in retail and wholesale payments. He said in 2021 that stablecoins should have access to central bank balance sheets — but only if strong protections were in place. “There’s been two systemic crises in money funds in little more than a decade [...] In baseball, it’s three strikes and you’re out. In cricket, it’s only the equivalent of one. For systemic payment systems, one is too many,” Carney stated. Kohani said, “With Mark Carney at the helm of the Liberal Party, we anticipate a pragmatic but regulation-first approach to crypto and stablecoins.” While his previous openness toward stablecoins suggests he’s open to the technology, he also “emphasizes the need for regulation, oversight and safeguards.” Another Liberal term, per Kohani, will likely mean the CSA continues to lead enforcement but could result in broader policy work, including a framework on stablecoins, “particularly if positioned as a tool for payments modernization and maintaining the relevance of the Canadian dollar.”\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee Explore more articles like this Subscribe to the Markets Outlook newsletter Get critical insights to spot investment opportunities, mitigate risks, and refine your trading strategies. Delivered every Monday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    },
    {
        "title": "Tariff flux pushes brands to bet big on digital merch",
        "content": "Dapper Labs VP Ridhima Kahn told Cointelegraph why digital merch is becoming the go-to strategy for major brands like the NBA, NFL and Disney. As more and more businesses are impacted by tariff volatility, some executives, like Ridhima Kahn, vice president of business development at Dapper Labs, are viewing the assault on the cost of physical goods as another use case for digital markets powered by blockchain to shine. “I’m seeing a lot of brands rethinking where revenue and fan engagement come from,” Kahn said during an exclusive interview with Cointelegraph. “A lot of franchises, like the ones we work with — NBA, NFL, Disney — have already had years of success with digital collection, and we’re seeing a lot of brands express interest in digital collectibles as a way to engage with fan bases at a time when physical costs are riskier and unknown.” Propelling brands to take a deeper look at digital merch is the desire to better understand fandom. Flow now has tradable highlights like a “LeBron Dunk” or a “Steph Curry 3-Pointer” that live inside the NBA app and has commemorative NFTs tied to NFL game highlights in NFL All Day. But with Super Bowl ticket stubs and other digital mementos powered by blockchain, digital goods are proving they can unlock deeper in real life (IRL) fan experiences, courtside or on the field. “When you look at the amount of time folks are spending online or in digital environments, it’s only increasing,” Kahn said. “That’s really motivating brands to identify where their fans are spending time and where they can reach them where they’re at. It’s also a great way to engage a more global fan base simultaneously, versus in a more limiting, geo-targeted way, which caters more toward the global fan bases that want to engage with these brands.” Because fan bases have become more globalized, the online experience just happens to offer a faster, more accessible environment for digital goods, particularly collectibles, versus the current marketplace for physical goods that’s being hampered by enigmatic tariffs. Related: Are Donald Trump’s tariffs a legal house of cards? “Average NFT sales are up 7% quarter-over-quarter, with NFL All Day and NBA Top Shot delivering $2.5 million and $5.6 million, respectively,” Kahn said. “We’re also seeing total value locked (TVL) at an all-time high of $44.4 million on Flow, led by protocols like KittyPunch and other markets that offer next-gen investing and trading opportunities — a trend that’s signaling a broadening use case for blockchain and crypto beyond just NFTs.” Helping broaden the blockchain use case is the recently enhanced onramping and offramping technology that’s permeated throughout the industry, enabling a smoother user experience for those getting started in crypto and the world of digital commodities than what was available three years earlier. Per Kahn: As more defined blockchain regulation is established, companies that might have initially been skeptical of blockchain are now taking it more seriously because regulators are taking it more seriously, helping boost confidence in the tech, especially among well-known brands. “IP-backed collections are winning,” Kahn said. “Upon Flow’s recent integration with OpenSea, NBA Top Shot was ranked among OpenSea’s top-five trending collections for four consecutive weeks. We go deep into specific fan bases to understand user behavior, and we A/B test our experiences, meaning the products we ultimately put out to market for fans are very well-vetted to ensure they’re actually what fans want.” Kahn and Dapper Labs CEO Roham Gharegozlou took a group of VIP collectors during the NBA’s in-season tournament to dinner and openly solicited their opinions on what they wanted to see more of on the platform. It’s the kind of swift, efficient, real-life research and development (R&D) that can more easily impact the end product, because the end product is digital. Related: 4chan rises from the dead: How the imageboard moves crypto markets “We take those insights back to our product team, and we embed those insights into our product to ensure we’re creating the best fan experience, agnostic of the technology we’re using to get there,” Kahn said. “It’s about what the fans want, and we leverage blockchain technology to deliver the fan experiences people might not be able to get elsewhere.” Elsewhere being the physical goods market. “The technology in our products really fades into the background, and what’s left is a collectible that feels meaningful, shareable and valuable,” Kahn said. “Digital collectibles unlock layers of engagement that physical goods cannot: They can be personalized, connected to real-world access, or used to reward loyalty for years and years to come. They’re also remixable, lightweight and global from day one.” But Khan doesn’t believe the physical goods market is going to go by the wayside anytime soon. Outside of the internet, sports and media fans are limited to where they are physically when it comes to purchasing a physical good and where they can take that physical good. But Kahn believes the next evolution of fandom is mobile. “We love the concept of being able to take your most prized possessions with you on your phone, wherever you are,” Kahn said. “Being limited to trading in a physical environment isn’t nearly as fun as being able to trade wherever you are with people all across the world.” Moving forward, Kahn believes brands will continue to expand their playbooks by engaging more with fans in digital spaces. “Consumers are also going to be more willing to adopt new ways to engage with brands in digital spaces if the value proposition is there,” Kahn said. “If we’re able to continue to offer utility to fans for what they do in a digital space — and what they do in a digital space benefits them in a physical world — that’s going to be the recipe for success.” Magazine: Crypto ‘more taboo than OnlyFans,’ says Violetta Zironi, who sold song for 1 BTC Explore more articles like this Subscribe to the Finance Redefined newsletter A weekly toolkit that breaks down the latest DeFi developments, offers sharp analysis, and uncovers new financial opportunities to help you make smart decisions with confidence. Delivered every Friday By subscribing, you agree to our\nTerms of Services and Privacy Policy Cointelegraph.com uses Cookies to ensure the best experience for you."
    }
]